2013/brp 2013-02-07/test/trunk/Vergelijking XML/Example XML's/afs_InschrijvingGeboorte_Request_new.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.bprbzk.nl/BRP/0100" xmlns:stuf="http://www.kinggemeenten.nl/StUF/StUF0302">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:AFS_RegistreerGeboorte_B>
         <ns:stuurgegevens>
            <stuf:berichtcode>Di02</stuf:berichtcode>
            <stuf:zender>
               <!--Optional:-->
               <stuf:organisatie>?</stuf:organisatie>
               <stuf:applicatie>?</stuf:applicatie>
            </stuf:zender>
            <stuf:referentienummer>?</stuf:referentienummer>
            <stuf:functie>?</stuf:functie>
         </ns:stuurgegevens>
         <ns:parameters ns:communicatieID="?">
            <ns:verwerkingswijze stuf:noValue="?">?</ns:verwerkingswijze>
         </ns:parameters>
         <ns:inschrijvingDoorGeboorte stuf:entiteittype="AdministratieveHandeling" ns:communicatieID="?">
            <ns:partijCode stuf:noValue="?">?</ns:partijCode>
            <ns:tijdstipOntlening stuf:noValue="?" stuf:exact="true">?</ns:tijdstipOntlening>
            <!--Optional:-->
            <ns:toelichtingOntlening stuf:noValue="?">?</ns:toelichtingOntlening>
            <!--Optional:-->
            <ns:gedeblokkeerdeMeldingen>
               <!--1 or more repetitions:-->
               <ns:gedeblokkeerdeMelding stuf:entiteittype="GedeblokkeerdeMelding" ns:referentieID="?" ns:communicatieID="?">
                  <ns:regelCode stuf:noValue="?">?</ns:regelCode>
                  <!--Optional:-->
                  <ns:attribuutNaam stuf:noValue="?">?</ns:attribuutNaam>
               </ns:gedeblokkeerdeMelding>
            </ns:gedeblokkeerdeMeldingen>
            <!--Optional:-->
            <ns:bijgehoudenDocumenten>
               <!--1 or more repetitions:-->
               <ns:document stuf:entiteittype="Document" ns:communicatieID="?">
                  <ns:soortNaam stuf:noValue="?">?</ns:soortNaam>
                  <ns:identificatie stuf:noValue="?">?</ns:identificatie>
                  <!--Optional:-->
                  <ns:aktenummer stuf:noValue="?">?</ns:aktenummer>
                  <ns:partijCode stuf:noValue="?">?</ns:partijCode>
               </ns:document>
            </ns:bijgehoudenDocumenten>
            <ns:acties>
               <ns:registratieGeboorte stuf:entiteittype="Actie" ns:communicatieID="?">
                  <ns:datumAanvangGeldigheid stuf:noValue="?" stuf:exact="true">?</ns:datumAanvangGeldigheid>
                  <!--Optional:-->
                  <ns:bronnen>
                     <!--You have a CHOICE of the next 1 items at this level-->
                     <!--Zero or more repetitions:-->
                     <ns:document stuf:entiteittype="Document" ns:referentieID="?" ns:communicatieID="?"/>
                  </ns:bronnen>
                  <ns:familierechtelijkeBetrekking stuf:entiteittype="Relatie" ns:communicatieID="?">
                     <ns:betrokkenheden>
                        <!--You have a CHOICE of the next 2 items at this level-->
                        <ns:kind stuf:entiteittype="Betrokkenheid" ns:communicatieID="?">
                           <ns:persoon stuf:entiteittype="Persoon" ns:referentieID="?" ns:communicatieID="?">
                              <!--Optional:-->
                              <ns:identificatienummers ns:communicatieID="?">
                                 <ns:burgerservicenummer stuf:noValue="?">?</ns:burgerservicenummer>
                                 <ns:administratienummer stuf:noValue="?">?</ns:administratienummer>
                              </ns:identificatienummers>
                              <ns:samengesteldeNaam ns:communicatieID="?">
                                 <ns:indicatieNamenreeks stuf:noValue="?">?</ns:indicatieNamenreeks>
                              </ns:samengesteldeNaam>
                              <ns:geboorte ns:communicatieID="?">
                                 <ns:datum stuf:noValue="?" stuf:exact="true">?</ns:datum>
                                 <ns:gemeenteCode stuf:noValue="?">?</ns:gemeenteCode>
                                 <!--Optional:-->
                                 <ns:woonplaatsCode stuf:noValue="?">?</ns:woonplaatsCode>
                              </ns:geboorte>
                              <ns:geslachtsaanduiding ns:communicatieID="?">
                                 <ns:code stuf:noValue="?">?</ns:code>
                              </ns:geslachtsaanduiding>
                              <!--Optional:-->
                              <ns:voornamen>
                                 <!--1 or more repetitions:-->
                                 <ns:voornaam stuf:entiteittype="PersoonVoornaam" ns:communicatieID="?">
                                    <ns:volgnummer stuf:noValue="?">?</ns:volgnummer>
                                    <ns:naam stuf:noValue="?">?</ns:naam>
                                 </ns:voornaam>
                              </ns:voornamen>
                              <!--Optional:-->
                              <ns:geslachtsnaamcomponenten>
                                 <ns:geslachtsnaamcomponent stuf:entiteittype="PersoonGeslachtsnaamcomponent" ns:communicatieID="?">
                                    <ns:volgnummer stuf:noValue="?">?</ns:volgnummer>
                                    <!--Optional:-->
                                    <ns:predikaatCode stuf:noValue="?">?</ns:predikaatCode>
                                    <!--Optional:-->
                                    <ns:adellijkeTitelCode stuf:noValue="?">?</ns:adellijkeTitelCode>
                                    <!--Optional:-->
                                    <ns:voorvoegsel stuf:noValue="?">?</ns:voorvoegsel>
                                    <!--Optional:-->
                                    <ns:scheidingsteken stuf:noValue="?">?</ns:scheidingsteken>
                                    <ns:naam stuf:noValue="?">?</ns:naam>
                                 </ns:geslachtsnaamcomponent>
                              </ns:geslachtsnaamcomponenten>
                           </ns:persoon>
                        </ns:kind>
                        <!--1 to 2 repetitions:-->
                        <ns:ouder stuf:entiteittype="Betrokkenheid" ns:communicatieID="?">
                           <ns:persoon stuf:entiteittype="Persoon" ns:technischeSleutel="?" ns:communicatieID="?">
                              <!--Optional:-->
                              <ns:soortCode stuf:noValue="?">?</ns:soortCode>
                              <!--Optional:-->
                              <ns:identificatienummers ns:technischeSleutel="?" ns:communicatieID="?">
                                 <!--Optional:-->
                                 <ns:administratienummer stuf:noValue="?">?</ns:administratienummer>
                              </ns:identificatienummers>
                              <!--Optional:-->
                              <ns:samengesteldeNaam ns:technischeSleutel="?" ns:communicatieID="?">
                                 <ns:indicatieNamenreeks stuf:noValue="?">?</ns:indicatieNamenreeks>
                                 <!--Optional:-->
                                 <ns:predikaatCode stuf:noValue="?">?</ns:predikaatCode>
                                 <!--Optional:-->
                                 <ns:voornamen stuf:noValue="?">?</ns:voornamen>
                                 <!--Optional:-->
                                 <ns:adellijkeTitelCode stuf:noValue="?">?</ns:adellijkeTitelCode>
                                 <!--Optional:-->
                                 <ns:voorvoegsel stuf:noValue="?">?</ns:voorvoegsel>
                                 <!--Optional:-->
                                 <ns:scheidingsteken stuf:noValue="?">?</ns:scheidingsteken>
                                 <ns:geslachtsnaam stuf:noValue="?">?</ns:geslachtsnaam>
                              </ns:samengesteldeNaam>
                              <!--Optional:-->
                              <ns:geboorte ns:technischeSleutel="?" ns:communicatieID="?">
                                 <ns:datum stuf:noValue="?" stuf:exact="true">?</ns:datum>
                                 <!--Optional:-->
                                 <ns:gemeenteCode stuf:noValue="?">?</ns:gemeenteCode>
                                 <!--Optional:-->
                                 <ns:woonplaatsCode stuf:noValue="?">?</ns:woonplaatsCode>
                                 <!--Optional:-->
                                 <ns:buitenlandsePlaats stuf:noValue="?">?</ns:buitenlandsePlaats>
                                 <!--Optional:-->
                                 <ns:buitenlandseRegio stuf:noValue="?">?</ns:buitenlandseRegio>
                                 <!--Optional:-->
                                 <ns:omschrijvingLocatie stuf:noValue="?">?</ns:omschrijvingLocatie>
                                 <ns:landCode stuf:noValue="?">?</ns:landCode>
                              </ns:geboorte>
                              <!--Optional:-->
                              <ns:geslachtsaanduiding ns:technischeSleutel="?" ns:communicatieID="?">
                                 <ns:code stuf:noValue="?">?</ns:code>
                              </ns:geslachtsaanduiding>
                           </ns:persoon>
                           <!--Optional:-->
                           <ns:ouderschap ns:communicatieID="?">
                              <ns:indicatieOuderUitWieKindIsVoortgekomen stuf:noValue="?">?</ns:indicatieOuderUitWieKindIsVoortgekomen>
                           </ns:ouderschap>
                        </ns:ouder>
                     </ns:betrokkenheden>
                  </ns:familierechtelijkeBetrekking>
               </ns:registratieGeboorte>
               <!--Optional:-->
               <ns:registratieAanschrijving stuf:entiteittype="Actie" ns:communicatieID="?">
                  <ns:datumAanvangGeldigheid stuf:noValue="?" stuf:exact="true">?</ns:datumAanvangGeldigheid>
                  <!--Optional:-->
                  <ns:bronnen>
                     <!--You have a CHOICE of the next 1 items at this level-->
                     <!--Zero or more repetitions:-->
                     <ns:document stuf:entiteittype="Document" ns:referentieID="?" ns:communicatieID="?"/>
                  </ns:bronnen>
                  <ns:persoon stuf:entiteittype="Persoon" ns:referentieID="?" ns:communicatieID="?">
                     <ns:aanschrijving ns:communicatieID="?">
                        <!--Optional:-->
                        <ns:indicatieTitelsPredikatenBijAanschrijven stuf:noValue="?">?</ns:indicatieTitelsPredikatenBijAanschrijven>
                        <ns:indicatieAlgoritmischAfgeleid stuf:noValue="?">?</ns:indicatieAlgoritmischAfgeleid>
                        <!--Optional:-->
                        <ns:predikaatCode stuf:noValue="?">?</ns:predikaatCode>
                        <!--Optional:-->
                        <ns:voornamen stuf:noValue="?">?</ns:voornamen>
                        <!--Optional:-->
                        <ns:adellijkeTitelCode stuf:noValue="?">?</ns:adellijkeTitelCode>
                        <!--Optional:-->
                        <ns:voorvoegsel stuf:noValue="?">?</ns:voorvoegsel>
                        <!--Optional:-->
                        <ns:scheidingsteken stuf:noValue="?">?</ns:scheidingsteken>
                        <!--Optional:-->
                        <ns:geslachtsnaam stuf:noValue="?">?</ns:geslachtsnaam>
                     </ns:aanschrijving>
                  </ns:persoon>
               </ns:registratieAanschrijving>
               <!--Zero or more repetitions:-->
               <ns:registratieNationaliteit stuf:entiteittype="Actie" ns:communicatieID="?">
                  <ns:datumAanvangGeldigheid stuf:noValue="?" stuf:exact="true">?</ns:datumAanvangGeldigheid>
                  <!--Optional:-->
                  <ns:bronnen>
                     <!--You have a CHOICE of the next 1 items at this level-->
                     <!--Zero or more repetitions:-->
                     <ns:document stuf:entiteittype="Document" ns:referentieID="?" ns:communicatieID="?"/>
                  </ns:bronnen>
                  <ns:persoon stuf:entiteittype="Persoon" ns:referentieID="?" ns:communicatieID="?">
                     <!--Optional:-->
                     <ns:nationaliteiten>
                        <ns:nationaliteit stuf:entiteittype="PersoonNationaliteit" ns:communicatieID="?">
                           <ns:nationaliteitCode stuf:noValue="?">?</ns:nationaliteitCode>
                           <!--Optional:-->
                           <ns:redenVerkrijgingCode stuf:noValue="?">?</ns:redenVerkrijgingCode>
                        </ns:nationaliteit>
                     </ns:nationaliteiten>
                  </ns:persoon>
               </ns:registratieNationaliteit>
               <!--Optional:-->
               <ns:registratieBehandeldAlsNederlander stuf:entiteittype="Actie" ns:communicatieID="?">
                  <ns:datumAanvangGeldigheid stuf:noValue="?" stuf:exact="true">?</ns:datumAanvangGeldigheid>
                  <!--Optional:-->
                  <ns:bronnen>
                     <!--You have a CHOICE of the next 1 items at this level-->
                     <!--Zero or more repetitions:-->
                     <ns:document stuf:entiteittype="Document" ns:referentieID="?" ns:communicatieID="?"/>
                  </ns:bronnen>
                  <ns:persoon stuf:entiteittype="Persoon" ns:referentieID="?" ns:communicatieID="?">
                     <ns:indicaties>
                        <ns:behandeldAlsNederlander stuf:entiteittype="PersoonIndicatie" ns:communicatieID="?">
                           <ns:waarde stuf:noValue="?">?</ns:waarde>
                        </ns:behandeldAlsNederlander>
                     </ns:indicaties>
                  </ns:persoon>
               </ns:registratieBehandeldAlsNederlander>
               <!--Optional:-->
               <ns:registratieStaatloos stuf:entiteittype="Actie" ns:communicatieID="?">
                  <ns:datumAanvangGeldigheid stuf:noValue="?" stuf:exact="true">?</ns:datumAanvangGeldigheid>
                  <!--Optional:-->
                  <ns:bronnen>
                     <!--You have a CHOICE of the next 1 items at this level-->
                     <!--Zero or more repetitions:-->
                     <ns:document stuf:entiteittype="Document" ns:referentieID="?" ns:communicatieID="?"/>
                  </ns:bronnen>
                  <ns:persoon stuf:entiteittype="Persoon" ns:referentieID="?" ns:communicatieID="?">
                     <ns:indicaties>
                        <ns:staatloos stuf:entiteittype="PersoonIndicatie" ns:communicatieID="?">
                           <ns:waarde stuf:noValue="?">?</ns:waarde>
                        </ns:staatloos>
                     </ns:indicaties>
                  </ns:persoon>
               </ns:registratieStaatloos>
               <!--Optional:-->
               <ns:registratieVerstrekkingsbeperking stuf:entiteittype="Actie" ns:communicatieID="?">
                  <ns:datumAanvangGeldigheid stuf:noValue="?" stuf:exact="true">?</ns:datumAanvangGeldigheid>
                  <!--Optional:-->
                  <ns:bronnen>
                     <!--You have a CHOICE of the next 1 items at this level-->
                     <!--Zero or more repetitions:-->
                     <ns:document stuf:entiteittype="Document" ns:referentieID="?" ns:communicatieID="?"/>
                  </ns:bronnen>
                  <ns:persoon stuf:entiteittype="Persoon" ns:referentieID="?" ns:communicatieID="?">
                     <ns:indicaties>
                        <ns:verstrekkingsbeperking stuf:entiteittype="PersoonIndicatie" ns:communicatieID="?">
                           <ns:waarde stuf:noValue="?">?</ns:waarde>
                        </ns:verstrekkingsbeperking>
                     </ns:indicaties>
                  </ns:persoon>
               </ns:registratieVerstrekkingsbeperking>
            </ns:acties>
         </ns:inschrijvingDoorGeboorte>
      </ns:AFS_RegistreerGeboorte_B>
   </soapenv:Body>
</soapenv:Envelope>